# -*- coding: UTF-8 -*-
import os
from openpyxl import load_workbook

# TODO:
# 汇总所有的TB
# 汇总所有的附注

# 合并策略：
# 1、不变
no_change = ["标准编码","科目余额表","本期ETY","新准则转换TB","新准则转换ETY","上期TB","上期ETY","审定报表分析性复核","重要性水平","资产表","负债表",
             "利润表","现金流量表","本期所有者权益变动表","上期所有者权益变动表","国有资本保值增值计算表","财务绩效评价指标",
             "校验","利息资本化校验","借款校验","税费校验表","薪酬校验表","折旧及摊销校验表","处置资产校验","政府补助校验",
             "递延所得税费用校验","投资收益核对","资产减值损失核对","子公司与少数股东现金流校验",
             "合并首次执行日前后金融资产分类和计量对比表","合并新旧金融工具调节表","合并金融资产减值准备调节表",
             "合并新金融工具准则对期初留存收益和其他综合收益的影响","新收入准则对期初合并财务报表的影响","新收入准则对年末合并资产负债表的影响",
             "新收入准则对合并利润表的影响","新租赁准则对期初合并报表的影响","合并最低经营租赁付款额与租赁负债调节表",
             "货币资金","受限制的货币资金","受限货币资金情况","交易性金融资产","以公允价值计量且其变动计入当期损益的金融资产",
             "衍生金融资产","应收票据分类原金融工具准则","应收票据分类新金融工具准则","已质押应收票据","已背书或贴现且在资产负债表日尚未到期的应收票据",
             "因出票人未履约而转为应收账款的票据","期末单项计提坏账准备的应收票据新金融工具准则","采用组合计提坏账准备的应收票据新金融工具准则",
             "应收票据坏账准备变动明细情况新金融工具准则","本期重要的应收票据坏账准备收回或转回情况新金融工具准则","本期实际核销的应收票据情况新金融工具准则",
             "应收账款期末数原金融工具准则","应收账款期初数原金融工具准则","应收账款期末数新金融工具准则","应收账款期初数新金融工具准则",
             "应收账款期末数首次新金融工具准则","应收账款期初数首次新金融工具准则","期末单项计提坏账准备的应收账款","采用账龄分析法计提坏账准备的应收账款原准则",
             "采用其他组合方法计提坏账准备的应收账款原准则","期末单项金额虽不重大但单项计提坏账准备的应收账款原准则","收回或转回的坏账准备情况",
             "本年实际核销的应收账款情况","按欠款方归集的年末余额前五名的应收账款情况","由金融资产转移而终止确认的应收账款","转移应收账款且继续涉入形成的资产负债",
             "采用组合计提坏账准备的应收账款首次执行","组合1名称首次执行","组合2名称首次执行","采用组合计提坏账准备的应收账款","组合1名称","组合2名称",
             "应收账款坏账准备变动明细情况新金融工具准则","应收款项融资","应收款项融资已转让已背书或已贴现未到期","预付账款账龄明细",
             "账龄超过1年的大额预付款项情况","按欠款方归集的年末余额前五名的预付账款情况","其他应收款原准则","其他应收款期末数首次新金融工具准则",
             "其他应收款期初数首次新金融工具准则","其他应收款期末数新金融工具准则","其他应收款期初数新金融工具准则","应收利息分类","重要逾期利息",
             "应收股利明细","其他应收款项期末明细原准则","其他应收款项期初明细原准则","期末单项计提坏账准备的其他应收款","采用组合计提坏账准备的其他应收款首次执行",
             "采用组合计提坏账准备的其他应收款新金融工具准则","其他应收款账龄情况新金融工具准则","其他应收款坏账准备变动情况新金融工具准则",
             "采用账龄分析法计提坏账准备的其他应收款项原准则","采用其他组合方法计提坏账准备的其他应收款原准则","期末单项金额虽不重大但单项计提坏账准备的其他应收款原准则",
             "其他应收款收回或转回的坏账准备情况","本年实际核销的其他应收款情况","其他应收款按性质分类情况","按欠款方归集的年末金额前五名的其他应收款项情况",
             "按应收金额确认的政府补助","由金融资产转移而终止确认的其他应收款项","转移其他应收款且继续涉入形成的资产负债","存货明细情况","存货跌价准备明细情况",
             "合同履约成本","存货期末余额中借款费用资本化情况","存货成本倒闸表","合同资产情况","合同资产本期的重大变动","期末单项计提坏账准备的合同资产",
             "采用组合计提坏账准备的合同资产","持有待售资产的基本情况","持有待售资产减值准备情况","一年内到期的非流动资产","其他流动资产",
             "合同取得成本","债权投资","债权投资减值准备","期末重要的债权投资","可供出售金融资产情况","期末按公允价值计量的可供出售金融资产","可供出售权益工具严重下跌但未计提减值",
             "其他债权投资期末数","其他债权投资期初数","其他债权投资减值准备","期末重要的其他债权投资","持有至到期投资明细情况","期末重要的持有至到期投资",
             "长期应收款明细情况","长期应收款坏账准备变动情况新金融工具准则","因金融资产转移而终止确认的长期应收款","转移长期应收款且继续涉入形成的资产负债金额",
             "长期股权投资分类情况","长期股权投资子公司明细情况","长期股权投资合营企业明细情况","长期股权投资联营企业明细情况","对合营企业投资和联营企业投资国有企业",
             "其他权益工具投资明细","期末重要的其他权益工具投资国有企业","非交易性权益工具投资情况上市公司","其他非流动金融资产","采用成本计量模式的投资性房地产国有企业",
             "采用成本计量模式的投资性房地产上市公司","采用公允价值计量模式的投资性房地产","未办妥产权证书的投资性房地产金额及原因","固定资产汇总",
             "固定资产情况国有企业","固定资产情况上市公司","暂时闲置的固定资产情况","通过经营租赁租出的固定资产","未办妥产权证书的固定资产情况","固定资产清理",
             "在建工程汇总","在建工程情况","重要在建工程项目本期变动情况","本期计提在建工程减值准备情况","工程物资","生产性生物资产上市公司",
             "生产性生物资产国有企业","油气资产上市公司","油气资产国有企业","使用权资产上市公司","使用权资产国有企业","无形资产国有企业",
             "无形资产上市公司","未办妥产权证书的土地使用权情况","开发支出","商誉账面价值","商誉减值准备","长期待摊费用",
             "未经抵销的递延所得税资产","未经抵销的递延所得税负债","未确认递延所得税资产明细","未确认递延所得税资产的可抵扣亏损将于以下年度到期",
             "其他非流动资产","短期借款明细情况","已逾期未偿还的短期借款情况","应付账款","账龄超过一年的重要应付账款","预收款项","预收款项账龄表","账龄一年以上重要的预收款项",
             "应付职工薪酬明细情况","短期薪酬列示","设定提存计划列示","应交税费","应交增值税计提","其他应付款汇总","应付利息","重要的已逾期未支付的利息情况",
             "应付股利","账龄一年以上重要的应付股利","其他应付款项","账龄超过一年的重要其他应付款项","长期借款","归属于权益工具持有者的信息",
             "长期应付款汇总","其他权益工具","资本公积","其他综合收益","专项储备","盈余公积","未分配利润","营业收入与营业成本","主营业务收入与主营业务成本",
             "其他业务收入与其他业务成本","财务费用分类表","会计利润与所得税费用调整过程","当期所得税费用计算表","所得税项目计算","现金流量表补充资料",
             "现金流补充资料计算","股份支付总体情况","以权益结算的股份支付情况","以现金结算的股份支付情况","分部信息业务分部期末数",
             "分部信息业务分部期初数","本公司对主要客户的依赖程度","净资产收益率及每股收益上市公司","净资产收益率计算表","每股收益计算表",
             "分类表","信息分类表"



             ]

# 2、插入列合并
columns_combine=[
    "本期TB","会计利润与所得税费用调整过程","本期支付的取得子公司的现金净额","现金流量表补充资料","本期收到的处置子公司的现金净额",
    "合并成本及商誉上市公司","被购买方于购买日可辨认资产负债上市公司","合并成本上市公司","合并日被合并方资产负债的账面价值上市公司",
    "交易对于少数股东权益及归属于母公司所有者权益的影响上市公司","重要合营企业财务信息本期数上市公司","重要合营企业财务信息上期数上市公司",
    "重要联营企业财务信息本期数上市公司","重要联营企业财务信息上期数上市公司","不重要合营企业和联营企业的汇总信息上市公司",
    "非经常性损益上市公司"]


#3、来源于母公司
parent = ["基础信息","主要税种及税率","实收资本","股本","母公司基本情况","关键管理人员薪酬"]

# 4、行合并,添加公司名称
rows_combine_and_company_name = ["单体首次执行日前后金融资产分类和计量对比表","单体新旧金融工具调节表","单体金融资产减值准备调节表",
                "单体新金融工具准则对期初留存收益和其他综合收益的影响","新收入准则对期初单体财务报表的影响","新收入准则对年末单体资产负债表的影响",
                "新收入准则对利润表的影响","新租赁准则对期初单体报表的影响","单体最低经营租赁付款额与租赁负债调节表","其他关联方情况",

                ]
# 行合并，不添加公司名称
rows_combine = ["子企业情况-国有企业","表决权不足半数但能形成控制-国有企业","半数以上表决权但未控制-国有企业","重要非全资子企业少数股东-国有企业",
                "重要非全资子企业期末资产负债-国有企业","重要非全资子企业期初资产负债-国有企业","重要非全资子企业本期损益和现金流量情况-国有企业",
                "重要非全资子企业上期损益和现金流量情况-国有企业","本年不再纳入合并范围原子公司的情况-国有企业",
                "原子公司在处置日和上一会计期间资产负债表日的财务状况-国有企业","原子公司本年年初至处置日的经营成果-国有企业",
                "本年新纳入合并范围的主体-国有企业","本年发生的同一控制下企业合并情况-国有企业","本年发生的非同一控制下企业合并情况-国有企业",
                "本年发生的反向购买-国有企业","本年发生的吸收合并-国有企业",
                "货币资金明细表","受限货币资金明细表","交易性金融资产明细表","以公允价值计量且其变动计入当期损益的金融资产明细表",
                "衍生金融资产明细表","应收票据明细表","已质押票据明细表","已背书或贴现且在资产负债表日尚未到期的应收票据明细表",
                "因出票人未履约而转为应收账款的票据明细表","应收账款明细表","应收款项融资明细表","应收款项融资已转让已背书或已贴现未到期明细表",
                "预付账款明细表","应收利息明细表","应收股利明细表","其他应收款明细表","房地产开发成本","房地产开发产品","合同履约明细表","确定可变现净值的具体依据",
                "存货明细表","合同资产明细表","持有待售资产明细表","一年内到期的非流动资产明细表","其他流动资产明细表","合同取得成本明细表",
                "债权投资明细表","债权投资减值准备明细表","可供出售债务工具明细表","可供出售权益工具明细表","其他债权投资明细表","其他债权投资减值准备明细表",
                "长期应收款明细表","长期应收款减值准备明细表","因金融资产转移而终止确认的长期应收款明细表","向投资企业转移资金的能力受到限制的有关情况国有企业",
                "长期股权投资明细表","合营企业和联营企业主要财务信息明细表","其他权益工具投资明细表","其他非流动金融资产明细表",
                "成本法核算投资性房地产明细表","采用公允价值计量模式的投资性房地产明细表","未办妥权证的投资性房地产明细表",
                "固定资产明细表","暂时闲置的固定资产明细表","经营租赁租出固定资产明细表","未办妥权证的固定资产明细表","固定资产清理明细表",
                "在建工程明细表","工程物资明细表","生产性生物资产明细表","油气资产明细表","使用权资产明细表","无形资产明细表",
                "未办妥产权证书的无形资产明细表","开发支出明细表","商誉明细表","长期待摊费用明细表","其他非流动资产明细表",
                "短期借款明细表","应付账款明细表","预收账款明细表","应付职工薪酬明细表","应交税费明细表","应付利息明细表","应付股利明细表",
                "其他应付款明细表","长期借款明细表","主营业务明细表","其他业务明细表","暂时性差异","可抵扣亏损",
                "非同一控制下企业合并上市公司","同一控制下企业合并上市公司","单次处置对子公司投资即丧失控制权上市公司","多次处置构成一揽子交易上市公司",
                "多次处置不构成一揽子交易上市公司","其他合并范围增加上市公司"," 其他合并范围减少上市公司","企业集团的构成上市公司",
                "重要的非全资子公司上市公司","重要非全资子企业期末资产负债上市公司","重要非全资子企业期初资产负债上市公司",
                "重要非全资子企业本期损益和现金流量情况上市公司","重要非全资子企业上期损益和现金流量情况上市公司",
                "在子公司的所有者权益份额发生变化的情况说明上市公司","重要的合营企业或联营企业上市公司","合营企业或联营企业发生的超额亏损上市公司",
                "重要的共同经营上市公司","第三层次公允价值计量项目期初与期末账面价值间的调节信息上市公司","不以公允价值计量的金融资产和金融负债的公允价值情况上市公司",
                ]

# 汇总合并:所有相同项目相加后合并，合计数最后列显示,同时添加一个明细表
add_combine=[
    "交易性金融负债","以公允价值计量且其变动计入当期损益的金融负债","衍生金融负债","应付票据","合同负债","持有待售负债",
    "一年内到期的非流动负债","其他流动负债","短期应付债券","应付债券","应付债券的增减变动","期末发行在外的优先股永续债等金融工具情况",
    "发行在外的优先股永续债等金融工具变动情况","租赁负债","长期应付款","专项应付款","长期应付职工薪酬明细情况","设定受益计划义务现值",
    "计划资产","设定受益计划净负债","预计负债","递延收益","递延收益中政府补助项目","其他非流动负债","税金及附加","销售费用","管理费用",
    "研发费用","财务费用","其他收益","投资收益","净敞口套期收益","公允价值变动损益","信用减值损失","资产减值损失","资产处置收益",
    "营业外收入","营业外支出","所得税费用","收到其他与经营活动有关的现金","支付其他与经营活动有关的现金","收到其他与投资活动有关的现金",
    "支付其他与投资活动有关的现金","收到其他与筹资活动有关的现金","支付其他与筹资活动有关的现金","现金及现金等价物的构成",
    "所有权或使用权受到限制的资产","外币货币性项目","采购商品接收劳务","出售商品提供劳务","本公司作为出租方","本公司作为承租方",
    "本公司作为承租方当期承担的租赁负债利息支出","本公司作为担保方","本公司作为担保方","本公司作为被担保方","关联方资金拆借","应收关联方款项",
    "应付关联方款项","关联方承诺上市公司","金融负债按剩余到期日分类期末数上市公司","金融负债按剩余到期日分类期初数上市公司","外币货币性项目上市公司",
    "外汇风险敏感性分析","利率敏感性分析上市公司","以公允价值计量的资产和负债的期末公允价值明细情况上市公司","资本承诺上市公司","按收入来源地划分的对外交易收入",
    "按资产所在地划分的非流动资产"
]

# 检查是否有遗漏的表格
def check_is_not_exist():
    all_tables = [*no_change,*columns_combine,*parent,*rows_combine,*rows_combine_and_company_name,*add_combine]

    import xlrd

    file = "D:/auditReport/project/model.xlsx"
    excels = xlrd.open_workbook(file)
    sheet_names = excels.sheet_names()
    for sheet_name in sheet_names:
        if sheet_name not in all_tables:
            print(sheet_name)

# 检查每个表格的表头是否有重复的标题
def check_title_is_duplicated():
    import xlrd
    file = "D:/auditReport/project/model.xlsx"
    bk=xlrd.open_workbook(file)
    excels = xlrd.open_workbook(file)
    sheet_names = excels.sheet_names()
    for sheet_name in sheet_names:
        sh = bk.sheet_by_name(sheet_name)
        row_data = sh.row_values(0)
        if len(row_data)!=len(set(row_data)):
            print(sheet_name,row_data)

# 复制一列到新的sheet中,返回新的sheet
def copy_column_index(file,old_sheet_name,new_sheet_name,old_sheet_column_num,new_sheet_column_num):

    wb = load_workbook(file)
    ws1 = wb[old_sheet_name]
    ws1_maxrows = ws1.max_row
    items = []
    i = 1
    while i < ws1_maxrows:
        items.append(ws1.cell(i, old_sheet_column_num).value)
        i = i + 1

    sheetnames = wb.sheetnames
    num = sheetnames.index(old_sheet_name)
    ws2 = wb.create_sheet(new_sheet_name, num)
    i = 1
    while i < ws1_maxrows:
        ws2.cell(i, new_sheet_column_num).value = items[i - 1]
        i = i + 1

    return ws2

# 插入列
import os
from openpyxl import load_workbook
file = "D:/auditReport/project/combine.xlsx"
wb = load_workbook(file)
sheetnames = wb.sheetnames
num = sheetnames.index("本期TB")
ws1 = wb["本期TB"]
ws1_maxrows = ws1.max_row
items = []
i=1
while i < ws1_maxrows:
    items.append(ws1.cell(i,1).value)
    i = i + 1

print(items)
ws2 = wb.create_sheet("合并TB", num)
i = 1
while i < ws1_maxrows:
    ws2.cell (i,1).value = items[i-1]
    i = i+1

i = 1




while i < ws1_maxrows:
    ws2.cell (i,2).value = "=[{}]本期TB!H{}".format(sheetname,i)
    i = i+1


path = os.getcwd()
all_files = [f for f in os.listdir(path)]
allow_suffix = ".xlsx"
# 合并工作表
combine_excel = "combine.xlsx"
for file in all_files:
    if file.endswith(allow_suffix):
        excels = xlrd.open_workbook(file)

wb.save('changed.xlsx')
